app/Services/WalletService.php

SELECT *
FROM `wallets`
WHERE `user_id` = '1'
 LIMIT 1
UPDATE `wallets` SET `balance` = 19
WHERE `wallets`.`id` IN ('1')
INSERT INTO `transactions` (`wallet_id`, `amount`, `transaction_type_id`, `created_at`) VALUES ('1', '1100', ('2'), '2026-05-09 11:51:42')
---
    public function debit($userId, $amount){
        $db = \Config\Database::connect();
        $db->transBegin();

        try {
            $wallet = $this->walletModel
                ->where('user_id', $userId)
                ->forUpdate()
                ->first();

            if (!$wallet) {
                throw new \Exception("Wallet not found");
            }

            if ($wallet['balance'] < $amount) {
                throw new \Exception("Insufficient balance");
            }

            $newBalance = $wallet['balance'] - $amount;

            $walletBalanceUpdate = $this->walletModel->update($wallet['id'], [
                'balance' => $newBalance
            ]);

            if (!$walletBalanceUpdate) {
                throw new \Exception("Wallet update failed");
            }

            $typeId = $this->transactionTypeModel->getTypeId('debit');

            $transaction = $this->transactionModel->insert([
                'wallet_id' => $wallet['id'],
                'amount' => $amount,
                'transaction_type_id' => $typeId
            ]);

SELECT *
FROM `wallets`
WHERE `user_id` = '1'
 LIMIT 1
---
    private function getWalletOrFail($userId){
        $wallet = $this->walletModel
            ->where('user_id', $userId)
            ->first();