app/Controllers/GoalController.php

    public function index()
    {
        $db = Database::connect();
        $goals = $db->table('goals')->get()->getResult();
---
SELECT *
FROM `goals`

public function save()
{
    $db = Database::connect();

    $userId = session()->get('user_id');

    // Détection de la requête AJAX (JSON)
    if ($this->request->isAJAX()) {
        $json = $this->request->getJSON();
        $goalId = $json->goal_id ?? null;
        $minKg = $json->min_kg ?? null;
        $maxKg = $json->max_kg ?? null;
    } else {
        // Fallback pour requête classique (formulaire POST)
        $goalId = $this->request->getPost('goal_id');
        $minKg = $this->request->getPost('min_kg');
        $maxKg = $this->request->getPost('max_kg');
    }

    $startDate = date('Y-m-d');

    // Validation de l'objectif
    if (!$goalId) {
        return $this->respondWithMessage(false, 'Objectif obligatoire');
    }

    $goal = $db->table('goals')->where('id', $goalId)->get()->getRow();
---
SELECT *
FROM `goals`
WHERE `id` = '2'

    }

    // Insertion
    $db->table('user_goals')->insert($data);
    $insertId = $db->insertID();

    // Récupération de l'objectif fraîchement inséré avec le nom
    $insertedGoal = $db->table('user_goals')
        ->select('user_goals.*, goals.name as goal_name')
        ->join('goals', 'goals.id = user_goals.goal_id')
        ->where('user_goals.id', $insertId)
        ->get()
        ->getRow();
---
INSERT INTO `user_goals` (`user_id`, `goal_id`, `start_date`, `min_kg`, `max_kg`) VALUES ('1', '2', '2026-05-10', '4', '9')
SELECT `user_goals`.*, `goals`.`name` as `goal_name`
FROM `user_goals`
JOIN `goals` ON `goals`.`id` = `user_goals`.`goal_id`
WHERE `user_goals`.`id` = 3