app/Controllers/ProfileController.php

public function index()
{
    $userId = session()->get('user_id');

    $profileModel = new \App\Models\UserProfilesModel();
    $bodyModel = new \App\Models\BodyMeasurementsModel();
    $userModel = new \App\Models\UsersModel();
    $healthService = new \App\Services\HealthService();

    $profile = $profileModel->where('user_id', $userId)->first();
---
SELECT *
FROM `user_profiles`
WHERE `user_id` = '1'
 LIMIT 1

public function complete()
{
    $userId = session()->get('user_id');
    $userModel = new \App\Models\UsersModel();
    $profileModel = new \App\Models\UserProfilesModel();

    $user = $userModel->getUserById($userId);
    $profile = $profileModel->where('user_id', $userId)->first();
---
SELECT *
FROM `user_profiles`
WHERE `user_id` = '4'
 LIMIT 1