app/Controllers/RegisterController.php

public function step1()
{
    $genderModel = new \App\Models\GenderModel();

    $data['genders'] = $genderModel->findAll();
---
SELECT *
FROM `gender`

    public function postStep2()
    {
        $userData = session()->get('register_user');

        $userModel = new UserModel();
        $bodyModel = new BodyMeasurementsModel();
        $walletsModel = new WalletsModel();

        // 1. Insert user
        $userId = $userModel->insert($userData);

        // 2. Insert body measurement
        $bodyModel->insert([
            'user_id' => $userId,
            'height' => $this->request->getPost('height'),
            'weight' => $this->request->getPost('weight'),
            'created_at' => date('Y-m-d')
        ]);

        // 3. Create wallet
        $walletsModel->insert([
            'user_id' => $userId,
            'balance' => 0
        ]);
---
INSERT INTO `users` (`name`, `email`, `password`, `gender_id`, `is_gold`) VALUES ('mark', 'mark@test.com', '$2y$10$re3aeHPldyU4.dw76pX4x.35tAdfYFDYfQcKyy.PNi8jQpFFFQjAS', '4', 0)
INSERT INTO `body_measurements` (`user_id`, `height`, `weight`, `created_at`) VALUES (7, '156', '34', '2026-05-08')
INSERT INTO `wallets` (`user_id`, `balance`) VALUES (7, 0)