app/Models/TransactionsModel.php

    public function getTransactionsByWalletId($walletId, $perPage = 10){
        return $this->where('wallet_id', $walletId)
                    ->orderBy('created_at', 'DESC')
                    ->paginate($perPage);
---
SELECT *
FROM `transactions`
WHERE `wallet_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `wallet_id` = '1'