app/Models/TransactionTypesModel.php

SELECT `id`
FROM `transaction_types`
WHERE `name` = 'debit'
 LIMIT 1
---
    public function getTypeId($name){
        return $this->select('id')
                    ->where('name', $name)
                    ->first();