app/Models/UsersModel.php

SELECT *
FROM `users`
WHERE `email` = 'adrien@mail.com'
 LIMIT 1
---
    public function getByEmail($email)
    {
        return $this->where('email', $email)->first();